In [182]:
import pandas as pd

#load data
data = pd.read_csv('C:/Users/RAJ/Desktop/PY/real-estate-predictor/data/bengaluru_house_prices.csv') 
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [184]:
data = data.drop(['area_type', 'availability','society'], axis=1) #delete collumns

In [186]:
data.isnull().sum() #check null values

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [188]:
data = data.dropna(subset=['location','size'])#delete null values from specific columns

In [190]:
data = data.reset_index(drop=True)# reset index number

In [192]:
data =data.rename(columns={'size' : 'bhk'}) # renamed column size

In [194]:
data.head()#check column

                   location        bhk total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [196]:
data['bhk'] = data['bhk'].str.split() #split the bhk columns value

In [198]:
data.head()# check column

                   location           bhk total_sqft  bath  balcony   price
0  Electronic City Phase II      [2, BHK]       1056   2.0      1.0   39.07
1          Chikka Tirupathi  [4, Bedroom]       2600   5.0      3.0  120.00
2               Uttarahalli      [3, BHK]       1440   2.0      3.0   62.00
3        Lingadheeranahalli      [3, BHK]       1521   3.0      1.0   95.00
4                  Kothanur      [2, BHK]       1200   2.0      1.0   51.00

In [200]:
for i in range(len(data['bhk'])):
    data['bhk'] = data['bhk'][i][0]  #removed string value

In [201]:
data.head()#check removal

                   location bhk total_sqft  bath  balcony   price
0  Electronic City Phase II   2       1056   2.0      1.0   39.07
1          Chikka Tirupathi   2       2600   5.0      3.0  120.00
2               Uttarahalli   2       1440   2.0      3.0   62.00
3        Lingadheeranahalli   2       1521   3.0      1.0   95.00
4                  Kothanur   2       1200   2.0      1.0   51.00

In [202]:
data['bhk'] = data['bhk'].astype(int) #convert type str to int

In [206]:
data.info()#chek data types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13303 entries, 0 to 13302
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13303 non-null  object
 1   bhk         13303 non-null  int32
 2   total_sqft  13303 non-null  object
 3   bath        13246 non-null  float64
 4   balcony     12710 non-null  float64
 5   price       13303 non-null  float64
dtypes: float64(3), int32(1), object(2)
memory usage: 571.7+ KB

In [208]:
data.head()#check data

                   location  bhk total_sqft  bath  balcony   price
0  Electronic City Phase II    2       1056   2.0      1.0   39.07
1          Chikka Tirupathi    2       2600   5.0      3.0  120.00
2               Uttarahalli    2       1440   2.0      3.0   62.00
3        Lingadheeranahalli    2       1521   3.0      1.0   95.00
4                  Kothanur    2       1200   2.0      1.0   51.00

In [210]:
data['location'] = data['location'].str.strip()#remove spaces from start and end in location column

In [212]:
loc_group = data.groupby('location')['location'].agg('count').sort_values(ascending=False)#group the value and arrange in descending order

In [214]:
rare_location = loc_group[loc_group <= 10]#save the rare location

In [216]:
data['location'] = data['location'].apply(lambda x: 'other' if x in rare_location else x) #replace rare locations to other

In [218]:
len(data['location'].unique())

242

In [220]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13303 entries, 0 to 13302
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13303 non-null  object
 1   bhk         13303 non-null  int32
 2   total_sqft  13303 non-null  object
 3   bath        13246 non-null  float64
 4   balcony     12710 non-null  float64
 5   price       13303 non-null  float64
dtypes: float64(3), int32(1), object(2)
memory usage: 571.7+ KB

In [222]:
data['total_sqft'] = data['total_sqft'].str.strip()

In [224]:
data['total_sqft'] = data['total_sqft'].str.split()

In [226]:
data['total_sqft'][2085]

['1250', '-', '1305']

In [247]:
for i in range (len(data['total_sqft'])):
    if '-' in data['total_sqft'][i]:
        data['total_sqft'][i] = (float(data['total_sqft'][i][0]) + float(data['total_sqft'][i][-1]))/2

2475
3210
3203
5611
1073
1242
1277
1630
1317
1132
5520
4046
5600
1177
4624
1122
582
1142
4348
657
649
1450
1000
971
1662
687
615
3430
2038
3715
665
4624
776
2817
3461
1277
825
1128
3715
1104
790
3035
3181
3539
2856
700
1559
1352
1185
1005
1707
1476
3181
1192
2912
630
1530
717
1664
3185
4303
1343
3416
1312
1137
458
2345
709
605
2094
2987
2072
1089
1625
2661
680
412
805
709
1462
1891
1617
1302
975
2585
630
2648
614
4334
2336
1302
3317
1405
1532
3550
2856
2856
1583
1115
1162
1580
1272
925
2856
698
1431
4062
1029
2195
1495
778
1155
3496
1700
1522
784
3385
777
2464
640
1773
3854
3181
4920
1745
762
693
800
728
2302
800
552
1495
775
1732
1532
1560
1131
2835
1260
1081
2065
583
790
1237
711
2895
801
2630
863
5020
1315
1530
612
907
2820
458
1360
3715
720
1773
1172
747
1590
1570
1322
3517
1003
2187
1639
2585
827
1355
1195
2500
1187
5667
777
825
1830
2858
705
1410
4225
1122
2283
1533
955
2038
1335
1075
1258
2856